Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Muhsin Khan.tmx
Source language: ar
Languages: en

source: كذبت ثمود بطغواها
en: Thamud (people) denied (their Prophet) through their transgression (by rejecting the true Faith of Islamic Monotheism, and by following polytheism, and by committing every kind of sin).

source: إذ انبعث أشقاها
en: When the most wicked man among them went forth (to kill the she-camel).

source: فقال لهم رسول الله ناقة الله وسقياها
en: But the Messenger of Allah [Salih عليه السلام] said to them: "Be cautious! (Fear the evil end). That is the she-camel of Allah! (Do not harm it) and bar it not from having its drink!"

source: فكذبوه فعقروها فدمدم عليهم ربهم بذنبهم فسواها
en: Then they denied him and they killed it. So their Lord destroyed them because of their sin, and made them equal in destruction (i.e. all grades of people, rich and poor, strong and weak, etc.)!

source: ولا يخاف عقباها
en: And He (Allah) feared not the consequences thereof.

source: والليل إذا يغشى
en: By the night as it envelops.

source: والنهار إذا تجلى
en: By the day as it appears in brightness.

source: وما خلق الذكر والأنثى
en: By Him Who created male and female.

source: إن سعيكم لشتى
en: Certainly, your efforts and deeds are diverse (different in aims and purposes);

source: فأما من أعطى واتقى
en: As for him who gives (in charity) and keeps his duty to Allah and fears Him,

source: وصدق بالحسنى
en: And believes in Al-Husna.

source: فسنيسره لليسرى
en: We will make smooth for him the path of ease (goodness).

source: وأما من بخل واستغنى
en: But he who is greedy miser and thinks himself self-sufficient.

source: وكذب بالحسنى
en: And belies Al-Husna (See the footnote of the Verse No.6)

source: فسنيسره للعسرى
en: We will make smooth for him the path for evil.

source: وما يغني عنه ماله إذا تردى
en: And what will his wealth avail him when he goes down (in destruction)?.

source: إن علينا للهدى
en: Truly! On Us is (to give) guidance.

source: وإن لنا للآخرة والأولى
en: And truly, unto Us (belong) the last (Hereafter) and the first (this world).

source: فأنذرتكم نارا تلظى
en: Therefore I have warned you of a blazing Fire (Hell).

source: لا يصلاها إلا الأشقى
en: None shall enter it save the most wretched.

source: الذي كذب وتولى
en: Who denies and turns away.

source: وسيجنبها الأتقى
en: And Al-Muttaqun (the pious - See V.2:2) will be far removed from it (Hell).

source: الذي يؤتي ماله يتزكى
en: He who spends his wealth for increase in self-purification,

source: وما لأحد عنده من نعمة تجزى
en: And who has (in mind) no favour from anyone to be paid back,

source: إلا ابتغاء وجه ربه الأعلى
en: Except to seek the Countenance of his Lord, the Most High.

source: ولسوف يرضى
en: He surely will be pleased (when he enters Paradise).

source: والضحى
en: By the forenoon (after sunrise).

source: والليل إذا سجى
en: By the night when it darkens (and stand still).

source: ما ودعك ربك وما قلى
en: Your Lord (O Muhammad صلى الله عليه وسلم) has neither forsaken you nor hates you.

source: وللآخرة خير لك من الأولى
en: And indeed the Hereafter is better for you than the present (life of this world).

source: ولسوف يعطيك ربك فترضى
en: And verily, your Lord will give you (all good) so that you shall be well-pleased.

source: ألم يجدك يتيما فآوى
en: Did He not find you (O Muhammad صلى الله عليه وسلم) an orphan and gave you a refuge?

source: ووجدك ضالا فهدى
en: And He found you unaware (of the Qur'an, its laws, and Prophethood) and guided you?

source: ووجدك عائلا فأغنى
en: And He found you poor and made you rich (self-sufficient with self-contentment)?

source: فأما اليتيم فلا تقهر
en: Therefore, treat not the orphan with oppression.

source: وأما السائل فلا تنهر
en: And repulse not the beggar.

source: وأما بنعمة ربك فحدث
en: And proclaim the Grace of your Lord (i.e. the Prophethood and all other Graces).

source: ألم نشرح لك صدرك
en: Have We not opened your breast for you (O Muhammad صلى الله عليه وسلم)?

source: ووضعنا عنك وزرك
en: And removed from you your burden.

source: الذي أنقض ظهرك
en: Which weighed down your back?

source: ورفعنا لك ذكرك
en: And have We not raised high your fame?

source: فإن مع العسر يسرا
en: Verily, along with every hardship is relief,

source: إن مع العسر يسرا
en: Verily, along with every hardship is relief (i.e. there is one hardship with two reliefs, so one hardship cannot overcome two reliefs).

source: فإذا فرغت فانصب
en: So when you have finished (your occupation), devote yourself for Allah's worship.

source: وإلى ربك فارغب
en: And to your Lord (Alone) turn (all your) intentions and hopes.

source: والتين والزيتون
en: By the fig, and the olive.

source: وطور سينين
en: By Mount Sinai.

source: وهذا البلد الأمين
en: By this city of security (Makkah).

source: لقد خلقنا الإنسان في أحسن تقويم
en: Verily, We created man in the best stature (mould).

source: ثم رددناه أسفل سافلين
en: Then We reduced him to the lowest of the low.

source: إلا الذين آمنوا وعملوا الصالحات فلهم أجر غير ممنون
en: Save those who believe (in Islamic Monotheism) and do righteous deeds. Then they shall have a reward without end (Paradise).

source: فما يكذبك بعد بالدين
en: Then what (or who) causes you (O disbelievers) to deny the Recompense (i.e. the Day of Resurrection)?

source: أليس الله بأحكم الحاكمين
en: Is not Allah the Best of judges?

source: اقرأ باسم ربك الذي خلق
en: Read! In the Name of your Lord Who has created (all that exists).

source: خلق الإنسان من علق
en: He has created man from a clot (a piece of thick coagulated blood).

source: اقرأ وربك الأكرم
en: Read! And your Lord is the Most Generous.

source: الذي علم بالقلم
en: Who has taught (the writing) by the pen.

source: علم الإنسان ما لم يعلم
en: He has taught man that which he knew not.

source: كلا إن الإنسان ليطغى
en: Nay! Verily, man does transgress (in disbelief and evil deed).

source: أن رآه استغنى
en: Because he considers himself self-sufficient.

source: إن إلى ربك الرجعى
en: Surely, unto your Lord is the return.

source: أرأيت الذي ينهى
en: Have you (O Muhammad صلى الله عليه وسلم) seen him (i.e. Abu Jahl) who prevents

source: عبدا إذا صلى
en: A slave (Muhammad صلى الله عليه وسلم) when he prays?

source: أرأيت إن كان على الهدى
en: Tell me if he (Muhammad صلى الله عليه وسلم) is on the guidance (of Allah)

source: أو أمر بالتقوى
en: Or enjoins piety!

source: أرأيت إن كذب وتولى
en: Tell me if he (Abu Jahl) denies (the truth, i.e. this Qur'an) and turns away?

source: ألم يعلم بأن الله يرى
en: Knows he not that Allah does see (what he does)?

source: كلا لئن لم ينته لنسفعا بالناصية
en: Nay! If he (Abu Jahl) ceases not, We will catch him by the forelock -

source: ناصية كاذبة خاطئة
en: A lying, sinful forelock!

source: فليدع ناديه
en: Then let him call upon his council (of helpers).

source: سندع الزبانية
en: We will call out the guards of Hell (to deal with him)!

source: كلا لا تطعه واسجد واقترب
en: Nay! (O Muhammad صلى الله عليه وسلم)! Do not obey him (Abu Jahl). Fall prostrate and draw near to Allah!

source: إنا أنزلناه في ليلة القدر
en: Verily, We have sent it (this Qur'an) down in the night of Al-Qadr (Decree).

source: وما أدراك ما ليلة القدر
en: And what will make you know what the night of Al-Qadr (Decree) is?

source: ليلة القدر خير من ألف شهر
en: The night of Al-Qadr (Decree) is better than a thousand months (i.e. worshipping Allah in that night is better than worshipping Him a thousand months, i.e. 83 years and 4 months).

source: تنزل الملائكة والروح فيها بإذن ربهم من كل أمر
en: Therein descend the angels and the Ruh [Jibril (Gabril)] by Allah's Permission with all Decrees,

source: سلام هي حتى مطلع الفجر
en: (All that night), there is Peace (and Goodness from Allah to His believing slaves) until the appearance of dawn.

source: لم يكن الذين كفروا من أهل الكتاب والمشركين منفكين حتى تأتيهم البينة
en: Those who disbelieve from among the people of the Scripture (Jews and Christians) and Al-Mushrikun, were not going to leave (their disbelief) until there came to them clear evidence.

source: رسول من الله يتلو صحفا مطهرة
en: A Messenger (Muhammad صلى الله عليه وسلم) from Allah, reciting (the Qur'an) purified pages [purified from Al-Batil (falsehood)].

source: فيها كتب قيمة
en: Wherein are correct and straight laws from Allah.

source: وما تفرق الذين أوتوا الكتاب إلا من بعد ما جاءتهم البينة
en: And the people of the Scripture (Jews and Christians) differed not until after there came to them clear evidence (i.e. Prophet Muhammad صلى الله عليه وسلم and whatever was revealed to him).

source: وما أمروا إلا ليعبدوا الله مخلصين له الدين حنفاء ويقيموا الصلاة ويؤتوا الزكاة وذلك دين القيمة
en: And they were commanded not, but that they should worship Allah, and worship none but Him Alone (abstaining from ascribing partners to Him), and perform As-Salat (Iqamat-as-Salat) and give Zakat, and that is the right religion.

source: إن الذين كفروا من أهل الكتاب والمشركين في نار جهنم خالدين فيها أولئك هم شر البرية
en: Verily, those who disbelieve (in the religion of Islam, the Qur'an and Prophet Muhammad صلى الله عليه وسلم) from among the people of the Scripture (Jews and Christians) and Al-Mushrikun will abide in the Fire of Hell. They are the worst of creatures.

source: إن الذين آمنوا وعملوا الصالحات أولئك هم خير البرية
en: Verily, those who believe [in the Oneness of Allah, and in His Messenger Muhammad صلى الله عليه وسلم) including all obligations ordered by Islam] and do righteous good deeds, they are the best of creatures.

source: جزاؤهم عند ربهم جنات عدن تجري من تحتها الأنهار خالدين فيها أبدا رضي الله عنهم ورضوا عنه ذلك لمن خشي ربه
en: Their reward with their Lord is 'Adn (Eden) Paradise (Gardens of Eternity), underneath which rivers flow. They will abide therein forever, Allah will be pleased with them, and they with Him. That is for him who fears his Lord.

source: إذا زلزلت الأرض زلزالها
en: When the earth is shaken with its (final) earthquake.

source: وأخرجت الأرض أثقالها
en: And when the earth throws out its burdens.

source: وقال الإنسان ما لها
en: And man will say: "What is the matter with it?"

source: يومئذ تحدث أخبارها
en: That Day it will declare its information (about all that happened over it of good or evil).

source: بأن ربك أوحى لها
en: Because your Lord will inspire it.

source: يومئذ يصدر الناس أشتاتا ليروا أعمالهم
en: That Day mankind will proceed in scattered groups that they may be shown their deeds.

source: فمن يعمل مثقال ذرة خيرا يره
en: So whosoever does good equal to the weight of an atom (or a small ant) shall see it.

source: ومن يعمل مثقال ذرة شرا يره
en: And whosoever does evil equal to the weight of an atom (or a small ant) shall see it.

source: والعاديات ضبحا
en: By the (steeds) that run, with panting.

source: فالموريات قدحا
en: Striking sparks of fire (by their hooves).

source: فالمغيرات صبحا
en: And scouring to the raid at dawn.

source: فأثرن به نقعا
en: And raise the dust in clouds the while.

source: فوسطن به جمعا
en: And penetrating forthwith as one into the midst (of the foe).

source: إن الإنسان لربه لكنود
en: Verily, man (disbeliever) is ungrateful to his Lord.

source: وإنه على ذلك لشهيد
en: And to that he bears witness (by his deeds).

source: وإنه لحب الخير لشديد
en: And verily, he is violent in the love of wealth.

source: أفلا يعلم إذا بعثر ما في القبور
en: Knows he not that when the contents of the graves are poured forth (all mankind is resurrected)?

source: وحصل ما في الصدور
en: And that which is in the breasts (of men) is made known?

source: إن ربهم بهم يومئذ لخبير
en: Verily, that Day (i.e. the Day of Resurrection) their Lord will be Well-Acquainted with them (as to their deeds and will reward them for their deeds).

source: القارعة
en: Al-Qari'ah (the striking Hour i.e. the Day of Resurrection).

source: ما القارعة
en: What is the striking (Hour)?

source: وما أدراك ما القارعة
en: And what will make you know what the striking (Hour) is?

source: يوم يكون الناس كالفراش المبثوث
en: It is a Day whereon mankind will be like moths scattered about.

source: وتكون الجبال كالعهن المنفوش
en: And the mountains will be like carded wool.

source: فأما من ثقلت موازينه
en: Then as for him whose balance (of good deeds) will be heavy,

source: وأما من خفت موازينه
en: But as for him whose balance (of good deeds) will be light,

source: فأمه هاوية
en: He will have his home in Hawiyah (pit, i.e. Hell).

source: وما أدراك ما هيه
en: And what will make you know what it is?

source: نار حامية
en: (It is) a fiercely blazing Fire!

source: ألهاكم التكاثر
en: The mutual rivalry (for piling up of worldly things) diverts you,

source: حتى زرتم المقابر
en: Until you visit the graves (i.e. till you die).

source: كلا سوف تعلمون
en: Nay! You shall come to know!

source: ثم كلا سوف تعلمون
en: Again nay! You shall come to know!

source: كلا لو تعلمون علم اليقين
en: Nay! If you knew with a sure knowledge (the end result of piling up, you would not have been occupied yourselves in worldly things).

source: لترون الجحيم
en: Verily, You shall see the blazing Fire (Hell)!

source: ثم لترونها عين اليقين
en: And again, you shall see it with certainty of sight!

source: ثم لتسألن يومئذ عن النعيم
en: Then on that Day you shall be asked about the delights (you indulged in, in this world)!

source: والعصر
en: By Al-'Asr (the time).

source: إن الإنسان لفي خسر
en: Verily, man is in loss,

source: إلا الذين آمنوا وعملوا الصالحات وتواصوا بالحق وتواصوا بالصبر
en: Except those who believe (in Islamic Monotheism) and do righteous good deeds, and recommend one another to the truth [i.e. order one another to perform all kinds of good deeds (Al-Ma'ruf) which Allah has ordained, and abstain from all kinds of sins and evil deeds (Al-Munkar which Allah has forbidden], and recommend one another to patience (for the sufferings, harms, and injuries which one may encounter in Allah's Cause during preaching His religion of Islamic Monotheism or Jihad).

source: ويل لكل همزة لمزة
en: Woe to every slanderer and backbiter.

source: الذي جمع مالا وعدده
en: Who has gathered wealth and counted it.

source: يحسب أن ماله أخلده
en: He thinks that his wealth will make him last forever!

source: كلا لينبذن في الحطمة
en: Nay! Verily, he will be thrown into the crushing Fire.

source: وما أدراك ما الحطمة
en: And what will make you know what the crushing Fire is?

source: نار الله الموقدة
en: The fire of Allah kindled,

source: التي تطلع على الأفئدة
en: Which leaps up over the hearts,

source: إنها عليهم مؤصدة
en: Verily, it shall be closed upon them,

source: في عمد ممددة
en: In pillars stretched forth (i.e. they will be punished in the Fire with pillars).

source: ألم تر كيف فعل ربك بأصحاب الفيل
en: Have you (O Muhammad صلى الله عليه وسلم) not seen how your Lord dealt with the owners of the Elephant? [The Elephant army which came from Yemen under the command of Abrahah Al-Ashram intending to destroy the Ka'bah at Makkah].

source: ألم يجعل كيدهم في تضليل
en: Did He not make their plot go astray?

source: وأرسل عليهم طيرا أبابيل
en: And He sent against them birds, in flocks,

source: ترميهم بحجارة من سجيل
en: Striking them with stones of Sijjil (baked clay).

source: فجعلهم كعصف مأكول
en: And He made them like (an empty field of) stalks (of which the corn has been eaten up by cattle).

source: لإيلاف قريش
en: (It is a great Grace from Allah) for the protection of the Quraish,

source: إيلافهم رحلة الشتاء والصيف
en: (And with all those Allah's Grace and Protections, We cause) the (Quraish) caravans to set forth safe in winter (to the south) and in summer (to the north without any fear),

source: فليعبدوا رب هذا البيت
en: So let them worship (Allah) the Lord of this House (the Ka'bah in Makkah),

source: الذي أطعمهم من جوع وآمنهم من خوف
en: (He) Who has fed them against hunger, and has made them safe from fear.

source: أرأيت الذي يكذب بالدين
en: Have you seen him who denies the Recompense?

source: فذلك الذي يدع اليتيم
en: That is he who repulses the orphan (harshly),

source: فويل للمصلين
en: So woe unto those performers of Salat (prayers) (hypocrites),

source: الذين هم عن صلاتهم ساهون
en: Those who delay their Salat (prayer from their stated fixed times).

source: الذين هم يراءون
en: Those who do good deeds only to be seen (of men),

source: ويمنعون الماعون
en: And prevent Al-Ma'un (small kindnesses like salt, sugar, water).

source: إنا أعطيناك الكوثر
en: Verily, We have granted you (O Muhammad صلى الله عليه وسلم) Al-Kauthar (a river in Paradise).

source: فصل لربك وانحر
en: Therefore turn in prayer to your Lord and sacrifice (to Him only).

source: إن شانئك هو الأبتر
en: For he who hates you (O Muhammad صلى الله عليه وسلم), he will be cut off (from posterity and every good thing in this world and in the Hereafter).

source: قل يا أيها الكافرون
en: Say: (O Muhammad صلى الله عليه وسلم to these Mushrikun and Kafirun): "O Al-Kafirun (disbelievers in Allah, in His Oneness, in His Angels, in His Books, in His Messengers, in the Day of Resurrection, and in Al-Qadar)!

source: لا أعبد ما تعبدون
en: "I worship not that which you worship,

source: ولا أنتم عابدون ما أعبد
en: "Nor will you worship that which I worship.

source: ولا أنا عابد ما عبدتم
en: "And I shall not worship that which you are worshipping.

source: لكم دينكم ولي دين
en: "To you be your religion, and to me my religion (Islamic Monotheism)."

source: إذا جاء نصر الله والفتح
en: When there comes the Help of Allah (to you, O Muhammad صلى الله عليه وسلم against your enemies) and the conquest (of Makkah).

source: ورأيت الناس يدخلون في دين الله أفواجا
en: And you see that the people enter Allah's religion (Islam) in crowds.

source: فسبح بحمد ربك واستغفره إنه كان توابا
en: So glorify the Praises of your Lord, and ask His Forgiveness. Verily, He is the One Who accepts the repentance and Who forgives.

source: تبت يدا أبي لهب وتب
en: Perish the two hands of Abu Lahab (an uncle of the Prophet) and perish he!

source: ما أغنى عنه ماله وما كسب
en: His wealth and his children will not benefit him!

source: سيصلى نارا ذات لهب
en: He will be burnt in a Fire of blazing flames!

source: وامرأته حمالة الحطب
en: And his wife, too, who carries wood (thorns of Sa'dan which she used to put on the way of the Prophet صلى الله عليه وسلم, or use to slander him).

source: في جيدها حبل من مسد
en: In her neck is a twisted rope of Masad (palm fibre).

source: قل هو الله أحد
en: Say (O Muhammad صلى الله عليه وسلم): "He is Allah, (the) One.

source: الله الصمد
en: "Allah-us-Samad (السيد الذي يصمد إليه في الحاجات) [Allah the Self-Sufficient Master, Whom all creatures need, (He neither eats nor drinks)].

source: لم يلد ولم يولد
en: "He begets not, nor was He begotten.

source: ولم يكن له كفوا أحد
en: "And there is none co-equal or comparable unto Him."

source: قل أعوذ برب الفلق
en: Say: "I seek refuge with (Allah), the Lord of the daybreak,

source: من شر ما خلق
en: "From the evil of what He has created,

source: ومن شر غاسق إذا وقب
en: "And from the evil of the darkening (night) as it comes with its darkness; (or the moon as it sets or goes away),

source: ومن شر النفاثات في العقد
en: "And from the evil of those who practise witchcraft when they blow in the knots,

source: ومن شر حاسد إذا حسد
en: "And from the evil of the envier when he envies."

source: قل أعوذ برب الناس
en: Say: "I seek refuge with (Allah) the Lord of mankind,

source: ملك الناس
en: "The King of mankind -

source: إله الناس
en: "The Ilah (God) of mankind,

source: من شر الوسواس الخناس
en: "From the evil of the whisperer (devil who whispers evil in the hearts of men) who withdraws (from his whispering in one's heart after one remembers Allah).

source: الذي يوسوس في صدور الناس
en: "Who whispers in the breasts of mankind.

source: من الجنة والناس
en: "Of jinn and men."
